PaxonHuang/EchoGlove-SLR-MOCAP-Beta/glove_firmware/p4_base_station/p4_firmware/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32p4"
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_HEX=y
CONFIG_ESP_CONSOLE_USB_CDC=y

# TinyUSB CDC (USB HS for P4→PC relay)
CONFIG_TINYUSB=y
CONFIG_TINYUSB_TASK_ENABLED=y
CONFIG_TINYUSB_CDC_ENABLED=y
CONFIG_TINYUSB_VENDOR_STR="EchoGlove"
CONFIG_TINYUSB_PRODUCT_STR="P4 Base Station"
